Introduction to Data Frames

In [224]:
import pandas as pd

df = pd.DataFrame([
    [1, 2, 3],
    [4, 5, 6],
    [8, 9, 10]
], columns=["A", "B", "C"]
, index = ["X", "Y", "Z"])

In [225]:
#df.head(2) First 2 rows
#df.tail(2)  Last 2 rows
#df.columns Headers
#df.index row indices
#df.info() Gives info on bytes or data types
#df.unique("A") Unique values in column A
#df.shape() Gives shape of the data frame row vs columns
#df.size() Total number of items
df.describe() #Gives data info on mean, stddev, median

              A         B          C
count  3.000000  3.000000   3.000000
mean   4.333333  5.333333   6.333333
std    3.511885  3.511885   3.511885
min    1.000000  2.000000   3.000000
25%    2.500000  3.500000   4.500000
50%    4.000000  5.000000   6.000000
75%    6.000000  7.000000   8.000000
max    8.000000  9.000000  10.000000

Loading Frames from Files

In [226]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
results = pd.read_parquet("./data/results.parquet")
olympics_data = pd.read_excel("./data/olympics-data.xlsx", sheet_name = "results") #You can specify which excel sheet in that file
bios = pd.read_csv("./data/bios.csv")
#.to_excel, .to_xlsx to change the file type

Accessing Data with Pandas

In [227]:
coffee.head(10)
coffee #-> will print out everything, can also use display(coffee)
coffee.sample(10) #Gets 10 random
#coffee.loc[row_label, column_label] loc is name-based
#coffee.loc[0:3] Return the value and information at index names 0 to 3
#coffee.index = coffee.Day All the indices are set to their corresponding days
coffee.iloc[:, [0,2]] #iloc is postion-based

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [228]:
#coffee.at[0, "Units Sold"]  Returns the value at the row-column intersection
coffee.iat[0, 1] #Integer based searching
#iat and at are optimized to search for a single value

'Espresso'

In [229]:
#coffee.Day gets the Day column but only works if one word
#coffee["Units Sold"] to get the Units Sold row

In [230]:
#coffee.sort_values("Units Sold", ascending = False) Sorting by Units sold column, ascending = True/False to reorder
coffee.sort_values(["Units Sold", "Coffee Type"]) #Sort by Units Sold then Coffee Type

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
0      Monday    Espresso          25
5   Wednesday       Latte          25
2     Tuesday    Espresso          30
7    Thursday       Latte          30
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45

In [231]:
#Iteration: Not recommended
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("\n\n")

0
Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object



1
Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object



2
Day             Tuesday
Coffee Type    Espresso
Units Sold           30
Name: 2, dtype: object



3
Day            Tuesday
Coffee Type      Latte
Units Sold          20
Name: 3, dtype: object



4
Day            Wednesday
Coffee Type     Espresso
Units Sold            35
Name: 4, dtype: object



5
Day            Wednesday
Coffee Type        Latte
Units Sold            25
Name: 5, dtype: object



6
Day            Thursday
Coffee Type    Espresso
Units Sold           40
Name: 6, dtype: object



7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object



8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object



9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object



10
Day            Saturday
Coffee Type    Espresso
Units Sold           45
Name: 10, dtype: object



11
Day            Saturday
Coffee Type       Latte
Units Sold           35
Name: 11, dtype: object



12
Day              Sunday
Coffee Type    Espresso
Units Sold           45
Name: 12, dtype: object



13
Day            Sunday
Coffee Type     Latte
Units Sold         35
Name: 13, dtype: object

Filtering Data

In [232]:
bios[(bios['height_cm'] > 215) & (bios['born_country'] == "USA")] #Filter the rows based on a condition
bios[bios['name'].str.contains("Keith|Patrick", case = False)] #Filter for string Keith or Patrick
#Can do much more with regular expressions
bios[(bios['born_country'].isin(["USA", "FRA", "GBR"])) & (bios['name'].str.startswith("Michael"))]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
2737,2749,Michael Chang,1972-02-22,Hoboken,New Jersey,USA,United States,175.0,72.0,NaN
3239,3251,Michael Tucker,1971-06-25,South Boston,Massachusetts,USA,United States,188.0,84.0,NaN
8589,8636,Michael Carbajal,1967-09-17,Phoenix,Arizona,USA,United States,165.0,48.0,NaN
9706,9761,Michael Mean,1947-02-18,Hertford,England,GBR,Great Britain,180.0,76.0,NaN
11006,11063,Michael Budrock,1929-09-03,Yonkers,New York,USA,United States,NaN,NaN,1998-02-13
...,...,...,...,...,...,...,...,...,...,...
140344,143851,Michaela Walsh,1993-06-05,Belfast,Northern Ireland,GBR,Ireland,NaN,NaN,NaN
143687,147341,Michael Cherry,1995-03-23,New York,New York,USA,United States,NaN,NaN,NaN
143688,147342,Michael Norman,1997-12-03,San Diego,California,USA,United States,185.0,78.0,NaN
143788,147444,Michael Grady,1996-10-22,Pittsburgh,Pennsylvania,USA,United States,196.0,91.0,NaN
143817,147473,Michael Andrew,1999-04-18,Edina,Minnesota,USA,United States,NaN,NaN,NaN

In [233]:
bios.query('born_country == "USA" & born_city == "Seattle"') #Another filter method is to use query

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
11030,11088,David Halpern,1955-08-18,Seattle,Washington,USA,United States,178.0,79.0,NaN
12800,12870,Todd Trewin,1958-04-20,Seattle,Washington,USA,United States,180.0,75.0,NaN
15476,15583,Scott McKinley,1968-10-15,Seattle,Washington,USA,United States,183.0,75.0,NaN
29079,29293,Joyce Tanac,1950-09-27,Seattle,Washington,USA,United States,156.0,49.0,NaN
31135,31371,Bill Kuhlemeier,1908-01-14,Seattle,Washington,USA,United States,NaN,NaN,2001-07-08
...,...,...,...,...,...,...,...,...,...,...
133392,136331,Hans Struzyna,1989-03-31,Seattle,Washington,USA,United States,188.0,91.0,NaN
135448,138662,Maude Davis Crossland,2003-03-19,Seattle,Washington,USA,Colombia,NaN,NaN,NaN
136993,140229,Jenell Berhorst,2003-12-13,Seattle,Washington,USA,United States,NaN,NaN,NaN
143507,147159,Nevin Harrison,2002-06-02,Seattle,Washington,USA,United States,175.0,73.0,NaN
145446,149169,Corinne Stoddard,2001-08-15,Seattle,Washington,USA,United States,NaN,NaN,NaN

Adding/Removing Columns

In [234]:
import numpy as np
#coffee['price'] = 4.99 Created a column called price 
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)
#Set price to 3.99 if Espresso else 5.99
#coffee.drop(columns = ['price']) Drops the price column
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price'] #New column to calculate revenue
coffee = coffee.rename(columns = {'new_price': 'price'}) #Rename a column
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso          25   3.99    99.75
1      Monday       Latte          15   5.99    89.85
2     Tuesday    Espresso          30   3.99   119.70
3     Tuesday       Latte          20   5.99   119.80
4   Wednesday    Espresso          35   3.99   139.65
5   Wednesday       Latte          25   5.99   149.75
6    Thursday    Espresso          40   3.99   159.60
7    Thursday       Latte          30   5.99   179.70
8      Friday    Espresso          45   3.99   179.55
9      Friday       Latte          35   5.99   209.65
10   Saturday    Espresso          45   3.99   179.55
11   Saturday       Latte          35   5.99   209.65
12     Sunday    Espresso          45   3.99   179.55
13     Sunday       Latte          35   5.99   209.65

In [235]:
bios_new = bios.copy()
bios_new['first_name'] = bios_new['name'].str.split(" ").str[0] #Create a new column of first name
bios_new.query('first_name == "Michael"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
145,146,Michael Helber,1970-10-04,Bochum,Nordrhein-Westfalen,GER,Germany,185.0,72.0,NaN,Michael
148,149,Michael Keck,1969-02-08,Fürth,Bayern,GER,Germany,186.0,78.0,NaN,Michael
160,161,Michael Stich,1968-10-18,Pinneberg,Schleswig-Holstein,GER,Germany,192.0,79.0,NaN,Michael
826,830,Michael Hyatt,1970-04-09,NaN,NaN,NaN,Jamaica,NaN,NaN,NaN,Michael
1220,1227,Michael Prevost,1953-06-05,Hameln,Niedersachsen,GER,Canada,176.0,71.0,NaN,Michael
...,...,...,...,...,...,...,...,...,...,...,...
144176,147854,Michael Föttinger,1997-06-12,Hallein,Salzburg,AUT,Austria,NaN,NaN,NaN,Michael
144501,148193,Michael Špaček,1997-04-09,Pardubice,Pardubický kraj,CZE,Czechia,180.0,NaN,NaN,Michael
144689,148387,Michael Salzer,1991-10-25,Stuttgart,Baden-Württemberg,GER,Germany,NaN,NaN,NaN,Michael
145196,148914,Michael Vogt,1997-12-29,Lachen,Schwyz,SUI,Switzerland,NaN,NaN,NaN,Michael
145226,148945,Michael Fora,1995-10-30,Giubiasco,Ticino,SUI,Switzerland,NaN,NaN,NaN,Michael

In [236]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])
#New column where born data is converted to datetime type
bios_new['born_year'] = bios_new['born_datetime'].dt.year #Extracts the year to make new column

bios_new[['name', 'born_year']]

bios_new.to_csv('./data/bios_new.csv') #saves the new version of our file

In [237]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else 'Average' if x < 185 else 'Tall')
#Lambda expression to classify heights
bios.head(4)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average

In [238]:
def categorize_athlete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'Lightweight'
    elif row['height_cm'] < 185 or row['weight_kg'] <= 80:
        return 'Middleweight'
    else:
        return 'Heavyweight'

bios['category'] = bios.apply(categorize_athlete, axis = 1) #1 is rows 0 is columns
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,Heavyweight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Average,Middleweight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Average,Middleweight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Average,Lightweight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,Heavyweight

Merging and Concatenating Data

In [239]:
bios = pd.read_csv("./data/bios.csv")
nocs = pd.read_csv("./data/noc_regions.csv")
bios_new = pd.merge(bios, nocs, left_on = 'born_country', right_on = 'NOC', how = 'left')
bios_new.rename(columns = {'region': 'born_country_full'}, inplace = True)
bios_new[bios_new['NOC_x'] != bios_new['born_country_full']][['name', 'NOC_x', 'born_country_full']]

                       name    NOC_x born_country_full
4              Albert Canet   France                UK
12                J. Defert   France               NaN
13           Étienne Durand   France               NaN
16               Guy Forget   France           Morocco
27       Guy, Baron Lejeune   France               NaN
...                     ...      ...               ...
145491        Matthew Wepke  Jamaica               NaN
145493   Landysh Falyakhova      ROC            Russia
145495    Polina Luchnikova      ROC            Russia
145496  Valeriya Merkusheva      ROC            Russia
145497      Yuliya Smirnova      ROC            Russia

[73210 rows x 3 columns]

In [240]:
usa = bios[bios['born_country'] == 'USA'].copy()
gbr = bios[bios['born_country'] == 'GBR'].copy()

In [241]:
usa.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN

In [242]:
new_df = pd.concat([usa, gbr]) #Concatenate the 2 dataframes
new_df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN

In [243]:
combined_df = pd.merge(results, bios, on = 'athlete_id', how = 'left')
combined_df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02

Handling Null Values

In [244]:
coffee.loc[[0, 1], 'Units Sold'] = np.nan #Set 0 and 1st row to NaN
coffee = coffee.fillna(coffee['Units Sold'].mean()) #Fill any nulls with the mean
#coffee['Units Sold'].interpolate() will interpolate the null values
#coffee.dropna() Drop any rows that have nulls
#coffee[coffee['Units Sold'].isna()] Returns only null value rows
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        35.0   3.99    99.75
1      Monday       Latte        35.0   5.99    89.85
2     Tuesday    Espresso        30.0   3.99   119.70
3     Tuesday       Latte        20.0   5.99   119.80
4   Wednesday    Espresso        35.0   3.99   139.65
5   Wednesday       Latte        25.0   5.99   149.75
6    Thursday    Espresso        40.0   3.99   159.60
7    Thursday       Latte        30.0   5.99   179.70
8      Friday    Espresso        45.0   3.99   179.55
9      Friday       Latte        35.0   5.99   209.65
10   Saturday    Espresso        45.0   3.99   179.55
11   Saturday       Latte        35.0   5.99   209.65
12     Sunday    Espresso        45.0   3.99   179.55
13     Sunday       Latte        35.0   5.99   209.65

Aggregating Data

In [245]:
bios['born_city'].value_counts() #Counts total occurences of every item
bios[bios['born_country'] == 'USA']['born_region'].value_counts().head(5)

born_region
California       1634
New York          990
Illinois          585
Pennsylvania      530
Massachusetts     530
Name: count, dtype: int64

In [247]:
coffee
coffee.groupby(['Coffee Type']).agg({'Units Sold': 'sum', 'price': 'mean'})
#Grouping by coffee type give data on the units sold and price

             Units Sold  price
Coffee Type
Espresso          275.0   3.99
Latte             215.0   5.99

In [ ]:
pivot = coffee.pivot(columns = 'Coffee Type', index = 'Day', values = 'revenue')
pivot
#pivot reorganizes the data based on column values

Coffee Type  Espresso   Latte
Day
Friday         179.55  209.65
Monday          99.75   89.85
Saturday       179.55  209.65
Sunday         179.55  209.65
Thursday       159.60  179.70
Tuesday        119.70  119.80
Wednesday      139.65  149.75

In [251]:
pivot.loc[['Monday', 'Sunday'], 'Latte']

Day
Monday     89.85
Sunday    209.65
Name: Latte, dtype: float64

In [254]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.year)['name'].count()

born_date
1828.0      1
1831.0      2
1833.0      1
1836.0      1
1837.0      1
         ...
2005.0    163
2006.0     17
2007.0      3
2008.0      3
2009.0      1
Name: name, Length: 177, dtype: int64

Advanced Functionality

In [257]:
# .shift .rank .rollling .cumsum
coffee['yesterday_revenue'] = coffee['revenue'].shift(1) #Created yestarday revenue with revenue values shifted down 1
coffee['percent_change'] = coffee['revenue'] / coffee['yesterday_revenue']
coffee.head()

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,percent_change
0,Monday,Espresso,35.0,3.99,99.75,NaN,NaN
1,Monday,Latte,35.0,5.99,89.85,99.75,0.900752
2,Tuesday,Espresso,30.0,3.99,119.70,89.85,1.332220
3,Tuesday,Latte,20.0,5.99,119.80,119.70,1.000835
4,Wednesday,Espresso,35.0,3.99,139.65,119.80,1.165693

In [266]:
bios['height_rank'] = bios['height_cm'].rank() #Gives ranking 
bios.sort_values('height_rank', ascending = False).head(5)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_rank
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN,106651.0
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN,106649.5
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN,106649.5
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN,106647.0
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN,106647.0

In [ ]:
#coffee.select_dtypes('float') select d_types to get columns with the specified data type
coffee['culmalative_revenue'] = coffee['revenue'].cumsum() #Gives culmalative sum
coffee

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,percent_change,culmalative_revenue
0,Monday,Espresso,35.0,3.99,99.75,NaN,NaN,99.75
1,Monday,Latte,35.0,5.99,89.85,99.75,0.900752,189.60
2,Tuesday,Espresso,30.0,3.99,119.70,89.85,1.332220,309.30
3,Tuesday,Latte,20.0,5.99,119.80,119.70,1.000835,429.10
4,Wednesday,Espresso,35.0,3.99,139.65,119.80,1.165693,568.75
5,Wednesday,Latte,25.0,5.99,149.75,139.65,1.072324,718.50
6,Thursday,Espresso,40.0,3.99,159.60,149.75,1.065776,878.10
7,Thursday,Latte,30.0,5.99,179.70,159.60,1.125940,1057.80
8,Friday,Espresso,45.0,3.99,179.55,179.70,0.999165,1237.35
9,Friday,Latte,35.0,5.99,209.65,179.55,1.167641,1447.00
10,Saturday,Espresso,45.0,3.99,179.55,209.65,0.856427,1626.55
11,Saturday,Latte,35.0,5.99,209.65,179.55,1.167641,1836.20
12,Sunday,Espresso,45.0,3.99,179.55,209.65,0.856427,2015.75
13,Sunday,Latte,35.0,5.99,209.65,179.55,1.167641,2225.40

In [271]:
latte = coffee[coffee['Coffee Type'] == 'Latte'].copy()
latte['3day'] = latte['Units Sold'].rolling(3).sum() #Gives rolling sum over last 3 days
latte

,Day,Coffee Type,Units Sold,price,revenue,yesterday_revenue,percent_change,culmalative_revenue,3day
1,Monday,Latte,35.0,5.99,89.85,99.75,0.900752,189.6,NaN
3,Tuesday,Latte,20.0,5.99,119.80,119.70,1.000835,429.1,NaN
5,Wednesday,Latte,25.0,5.99,149.75,139.65,1.072324,718.5,80.0
7,Thursday,Latte,30.0,5.99,179.70,159.60,1.125940,1057.8,75.0
9,Friday,Latte,35.0,5.99,209.65,179.55,1.167641,1447.0,90.0
11,Saturday,Latte,35.0,5.99,209.65,179.55,1.167641,1836.2,100.0
13,Sunday,Latte,35.0,5.99,209.65,179.55,1.167641,2225.4,105.0